tests/mocks/fake_invoice_edit.json

{
    "id": "inv_gHQwerty123ggd",
    "entity": "invoice",
    "receipt": "BILL13375649",
    "invoice_number": null,
    "customer_id": "cust_00000000000001",
    "customer_details": {
        "name": "Gaurav Kumar",
        "email": "gaurav.kumar@razorpay.com",
        "contact": "9123456789",
        "billing_address": null,
    },
    "order_id": null,
    "line_items": [
        {
            "id": "li_gHQwerty123gg1",
            "item_id": null,
            "name": "Book / English August - Updated name and quantity",
            "description": "Funny story of an IAS officer wanting to be aything other than an IAS.",
            "amount": 20000,
            "unit_amount": 20000,
            "gross_amount": 20000,
            "tax_amount": 0,
            "net_amount": 20000,
            "currency": "INR",
            "type": "invoice",
            "tax_inclusive": false,
            "unit": null,
            "quantity": 1,
            "taxes": []
        },
        {
            "id": "li_gHQwerty123gg2",
            "item_id": null,
            "name": "Book / A Wild Sheep Chase",
            "description": null,
            "amount": 20000,
            "unit_amount": 20000,
            "gross_amount": 20000,
            "tax_amount": 0,
            "net_amount": 20000,
            "currency": "INR",
            "type": "invoice",
            "tax_inclusive": false,
            "unit": null,
            "quantity": 1,
            "taxes": []
        },
        {
            "id": "li_gHQwerty123gg3",
            "item_id": "null",
            "name": "Book / Rocket Man: Elon Musk in His Own Words",
            "description": "Elon Musk, the South African--born entrepreneur who made his first fortune with Internet companies such as PayPal, has risen to global prominence as the visionary CEO of both Tesla Motors and SpaceX",
            "amount": 20000,
            "unit_amount": 20000,
            "gross_amount": 20000,
            "tax_amount": 0,
            "net_amount": 20000,
            "currency": "INR",
            "type": "invoice",
            "tax_inclusive": false,
            "unit": null,
            "quantity": 1,
            "taxes": []
        }
    ],
    "payment_id": null,
    "status": "draft",
    "expire_by": null,
    "issued_at": null,
    "paid_at": null,
    "cancelled_at": null,
    "expired_at": null,
    "sms_status": "pending",
    "email_status": "pending",
    "date": 1505937098,
    "terms": null,
    "partial_payment": false,
    "gross_amount": 20000,
    "tax_amount": 0,
    "amount": 20000,
    "amount_paid": null,
    "amount_due": null,
    "currency": "INR",
    "description": null,
    "notes": {
        "updated-key": "An updated note."
    },
    "comment": null,
    "short_url": null,
    "view_less": true,
    "billing_start": null,
    "billing_end": null,
    "type": "invoice",
    "group_taxes_discounts": false,
    "user_id": null,
    "created_at": 1505935715
}
